Use mermaid graph for How it Works on sdk-reference
